# vim: set ft=ruby

cask_args appdir: '/Applications'

brew 'python'
brew 'ruby'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'git'
brew 'irssi'
brew 'pass'
brew 'rbenv'
brew 'ruby-build'
brew 'vim'
brew 'zsh'
brew 'mplayer'
brew 'htop'
brew 'newsbeuter'
brew 'wget'
brew 'nmap'
brew 'the_silver_searcher'
brew 'tmux'

tap 'caskroom/cask'

cask 'bitbar'
cask 'droplr'
cask 'google-chrome'
cask 'gpgtools'
cask 'minecraft'
cask 'slack'
cask 'spectacle'
cask 'vlc'
cask 'atom'
cask 'transmission'
