# vim: set ft=ruby

# taps
tap "audy/deskclean", "https://github.com/audy/deskclean"
tap "homebrew/cask"
tap "homebrew/core"
tap "audy/gdl"
tap "porter-dev/porter"

# casks
cask "1password"
cask "1password-cli"
cask "claude"
cask "espanso"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "linear-linear"
cask "minecraft"
cask "monitorcontrol"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "paintbrush"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "vlc"
cask "xbar"
cask "zed"

# dev
brew "asciiquarium"
brew "atuin"
brew "awscli"
brew "cffi"
brew "coreutils"
brew "csvkit"
brew "csvtk"
brew "curl"
brew "fastfetch"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "gron"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "neovim"
brew "openjdk", link: true
brew "parallel"
brew "pigz"
brew "porter-dev/porter/porter"
brew "postgresql@14", restart_service: :changed
brew "pwgen"
brew "rclone"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"
brew 'hugo'
brew 'nmap'
brew 'node'

# bioinformatics
brew "bcftools"
brew "bedtools"
brew "blast"
brew "htslib"
brew "minimap2"
brew "samtools"
brew "seqkit"
brew "seqtk"
brew "audy/gdl/gdl"

# fonts
cask "font-comic-mono"
cask "font-departure-mono"
cask "font-fira-mono"
cask "font-monaspace"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
