# vim: set ft=ruby
# usage: brew bundle --cleanup

# taps
tap "homebrew/cask"
tap "homebrew/core"
tap "audy/tap"
tap "porter-dev/porter"
tap "onecodex/tap"

# casks
cask "bitwarden"
cask "calibre"
cask "claude"
cask "claude-code"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "linear-linear"
cask "minecraft"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "orion"
cask "paintbrush"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "vlc"
cask "xbar"

# dev
brew "asciiquarium"
brew "atuin"
brew "awscli"
brew "cffi"
brew "coreutils"
brew "csvkit"
brew "csvtk"
brew "curl"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "gron"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "lsd"
brew "mergiraf"
brew "neovim", args: ['HEAD']
brew "nmap"
brew "node"
brew "openjdk", link: true
brew "parallel"
brew "pigz"
brew "porter-dev/porter/porter"
brew "postgresql@14", restart_service: :changed
brew "pre-commit"
brew "pwgen"
brew "rclone"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "s5cmd"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "wakeonlan"

# neovim + lsps
brew "pyright"
brew "tree-sitter"
brew "bash-language-server"
brew "lua-language-server"
brew "typescript-language-server"

# bioinformatics
brew "bcftools"
brew "bedtools"
brew "blast"
brew "htslib"
brew "minimap2"
brew "samtools"
brew "seqkit"
brew "seqtk"
brew "audy/tap/gdl"
brew "audy/tap/deskclean"

# fonts
cask "font-comic-mono"
cask "font-departure-mono"
cask "font-fira-mono"
cask "font-monaspace"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
